md1 = r'''基本边界值测试用例：13个

Year(1800-2100)的基本边界（最小值，略高于最小值、正常值、略低于最大值和最大值）分别为: 1800, 1801, 2021, 2099, 2100

Month的基本边界（最小值，略高于最小值、正常值、略低于最大值和最大值）: 1(31), 2(28/29), 6(30), 11(30), 12(31)

Day的基本边界（最小值，略高于最小值、正常值、略低于最大值和最大值）: 1, 2, 14, 30, 31
'''

md2 = r'''健壮边界值测试用例：6个

Year(1800-2100)的健壮性边界(略小于最小值、略大于最大值)：1799, 2101

Month的健壮性边界(略小于最小值、略大于最大值)：0, 13

Day的健壮性边界(略小于最小值、略大于最大值)：0, 32
'''

md3 = r'''为了保证程序的鲁棒性，额外增加了一些平闰年2月、跨年的测试用例：4个

'''

md4 = r'''有效等价类：

Year：{非闰年}, {Year % 4 = 0 and Year % 100 != 0}, {Year % 400 = 0}

Month：{除12月之外的大月}, {12}, {2}, {小月}

Day：{1,2,...,27}, {28}, {29}, {30}, {31}
'''

md5 = r'''无效等价类：

Year：{Year < 1800}, {Year > 2100}

Month：{Month < 1}, {Month > 12}

Day：{Day < 1}, {Day > 31}
'''

md6 = r'''弱一般等价类测试用例：5个
'''

md7 = r'''强一般等价类测试用例：60个
'''

md8 = r'''额外弱健壮测试用例：6个
'''